Repository: Carfer0410/Scanner_crush
Catalog: lib/l10n/app_*.arb
Languages: es

# insightMasterLove
source: Master of Love
es: Master del Amor

# insightMasterLoveDesc
source: Your average compatibility is exceptional ({percent}%). You have a natural gift for love!
es: Tu compatibilidad promedio es excepcional ({percent}%). ¡Tienes un don natural para el amor!

# insightGoodRadar
source: Good Love Radar
es: Buen Radar Amoroso

# insightGoodRadarDesc
source: Your average compatibility is solid ({percent}%). You trust your instincts.
es: Tu compatibilidad promedio es sólida ({percent}%). Confías en tus instintos.

# insightExplorerLove
source: Love Explorer
es: Explorador del Amor

# insightExplorerLoveDesc
source: You are exploring different types of connections. Every scan brings you closer to your perfect match!
es: Estás explorando diferentes tipos de conexiones. ¡Cada escaneo te acerca más a tu match perfecto!

# insightCelebrityCrusherDesc
source: You prefer celebrities ({percent}% of your scans). You like high standards!
es: Prefieres las celebridades ({percent}% de tus escaneos). ¡Te gustan los estándares altos!

# insightTrueRomantic
source: True Romantic
es: Romántico Auténtico

# insightTrueRomanticDesc
source: You prefer real connections ({percent}% of your scans). True love calls you.
es: Prefieres conexiones reales ({percent}% de tus escaneos). El amor verdadero te llama.

# insightExpert
source: Compatibility Expert
es: Experto en Compatibilidad

# insightExpertDesc
source: With {scans} scans, you are an expert. Your experience is invaluable.
es: Con {scans} escaneos, eres todo un experto. Tu experiencia es invaluable.

# insightDedicatedUser
source: Dedicated User
es: Usuario Dedicado

# insightDedicatedUserDesc
source: You already have {scans} scans. Your dedication to love is admirable!
es: Ya llevas {scans} escaneos. ¡Tu dedicación al amor es admirable!

# insightCommittedExplorer
source: Committed Explorer
es: Explorador Comprometido

# insightCommittedExplorerDesc
source: With {scans} scans, you are building a solid profile. Keep it up!
es: Con {scans} escaneos, estás construyendo un perfil sólido. ¡Sigue así!

# insightNewAdventurer
source: New Adventurer
es: Nuevo Aventurero

# insightNewAdventurerDesc
source: You have started your journey of love discovery. Every scan reveals something new!
es: Has comenzado tu viaje de descubrimiento amoroso. ¡Cada escaneo revela algo nuevo!

# predictionLoveRising
source: Love Rising
es: Amor en Ascenso

# predictionLoveRisingDesc
source: Your compatibility has improved lately. The coming weeks will be promising for love.
es: Tu compatibilidad ha mejorado últimamente. Las próximas semanas serán prometedoras para el amor.

# predictionTimeReflection
source: Time for Reflection
es: Tiempo de Reflexión

# predictionTimeReflectionDesc
source: It's a good time to reflect on what you seek in love. Clarity will bring better connections.
es: Es un buen momento para reflexionar sobre qué buscas en el amor. La claridad traerá mejores conexiones.

# predictionStableLove
source: Stable Love
es: Amor Estable

# predictionStableLoveDesc
source: Your compatibility remains consistent. It's a good time to consolidate connections.
es: Tu compatibilidad se mantiene consistente. Es un buen momento para consolidar conexiones.

# predictionDiscoveringPattern
source: Discovering Your Pattern
es: Descubriendo Tu Patrón

# predictionDiscoveringPatternDesc
source: You are building your love profile. Each scan helps us better understand your preferences.
es: Estás construyendo tu perfil amoroso. Cada escaneo nos ayuda a entender mejor tus preferencias.

# predictionJourneyStart
source: Start of Your Journey
es: Inicio de Tu Viaje

# predictionJourneyStartDesc
source: You have started your love exploration. Keep scanning to discover fascinating patterns!
es: Has comenzado tu exploración amorosa. ¡Sigue escaneando para descubrir patrones fascinantes!

# predictionPerfectMatchNear
source: Perfect Match Near
es: Match Perfecto Cerca

# predictionPerfectMatchNearDesc
source: Your high average compatibility ({percent}%) suggests your perfect match is very close. Keep your eyes open.
es: Tu alta compatibilidad promedio ({percent}%) sugiere que tu match perfecto está muy cerca. Mantén los ojos abiertos.

# predictionGoodLovePath
source: Good Love Path
es: Buen Camino Amoroso

# predictionGoodLovePathDesc
source: Your average compatibility ({percent}%) shows you have good judgment. Trust your instincts.
es: Tu compatibilidad promedio ({percent}%) muestra que tienes buen criterio. Confía en tus instintos.

# predictionLoveAwaits
source: Love Awaits You
es: El Amor Te Espera

# predictionLoveAwaitsDesc
source: Each scan brings you closer to understanding love. Keep exploring and discovering your path!
es: Cada escaneo te acerca más a entender el amor. ¡Sigue explorando y descubriendo tu camino!

# errorGeneratingResult
source: Error generating result. Please try again.
es: Error al generar resultado. Inténtalo de nuevo.

# helloCelebrity
source: Hello {userName}!
es: ¡Hola {userName}!

# chooseCelebrityDescription
source: Choose your celebrity crush and discover your compatibility
es: Elige tu celebrity crush y descubre tu compatibilidad

source: Search celebrity...
es: Buscar celebridad...

source: No insights yet
es: No hay insights todavía

# scanMoreForInsights
source: Scan more to get personalized insights
es: Realiza más escaneos para obtener insights personalizados

# noPredictionsYet
source: No predictions available
es: No hay predicciones disponibles

# scanMoreForPredictions
source: Scan more to generate predictions about your love life
es: Realiza más escaneos para generar predicciones sobre tu vida amorosa

# bannerLoaded
source: Banner Ad loaded successfully
es: Banner Ad cargado correctamente

# bannerLoadError
source: Error loading Banner Ad:
es: Error cargando Banner Ad:

source: 🎯 Testing Banner Ad...
es: 🎯 Probando Banner Ad...

# bannerAdWorking
source: ✅ Banner Ad is working
es: ✅ Banner Ad está funcionando

# bannerAdNotLoaded
source: ❌ Banner Ad is not loaded
es: ❌ Banner Ad no está cargado

source: 🎯 Testing Interstitial Ad...
es: 🎯 Probando Interstitial Ad...

source: ✅ Interstitial Ad available
es: ✅ Interstitial Ad disponible

source: ✅ Interstitial shown
es: ✅ Interstitial mostrado

# interstitialShowError
source: ❌ Error showing Interstitial
es: ❌ Error mostrando Interstitial

# interstitialNotReady
source: ⚠️ Interstitial Ad is not ready
es: ⚠️ Interstitial Ad no está listo

source: 🎯 Testing Rewarded Ad...
es: 🎯 Probando Rewarded Ad...

# rewardedAdShown
source: ✅ Rewarded Ad shown and reward granted
es: ✅ Rewarded Ad mostrado y recompensa otorgada

# rewardedAdError
source: ❌ Error with Rewarded Ad
es: ❌ Error con Rewarded Ad

# adsTestTitle
source: Ads Test
es: Prueba de Anuncios

source: System Status
es: Estado del Sistema

source: 📱 Live Banner Ad:
es: 📱 Banner Ad en vivo:

source: Test Results
es: Resultados de Pruebas

# pressButtonsToTestAds
source: Press the buttons to test the ads
es: Presiona los botones para probar los anuncios

# errorLoadingLoveDay
source: Could not load your love day: {error}
es: No se pudo cargar tu día del amor: {error}

# freeTrialBannerTitle
source: FREE Trial Period!
es: ¡Período de Prueba GRATIS!

# freeTrialBannerDayLeft
source: 1 DAY LEFT
es: 1 DÍA RESTANTE

# freeTrialBannerDaysLeft
source: {days} DAYS LEFT
es: {days} DÍAS RESTANTES

# freeTrialBannerUnlimited
source: Unlimited scans!
es: ¡Escaneos ilimitados!

# freeTrialBannerEnjoy
source: Enjoy unlimited love scans during your trial
es: Disfruta escaneos de amor ilimitados durante tu prueba

source: Daily Streak
es: Racha Diaria

# startLoveStreak
source: Start your love streak today!
es: ¡Comienza tu racha hoy!

source: Best
es: Mejor

# streakStatsTitle
source: 🔥 Streak Stats
es: 🔥 Estadísticas de Racha

source: Learn about stats
es: Aprende sobre las estadísticas

# streakStatsDialogCurrent
source: Current Streak
es: Racha Actual

# streakStatsDialogBest
source: Best Streak
es: Mejor Racha

# streakStatsDialogTotal
source: Total Scans
es: Escaneos Totales

# streakInfoDialogTitle
source: What do these stats mean?
es: ¿Qué significan estas estadísticas?

# streakInfoCurrentDesc
source: How many consecutive days you've used the app without missing a day.
es: Cuántos días consecutivos has usado la app sin faltar ni un día.

# streakInfoCurrentExample
source: Example: If you used it yesterday and today, your current streak is 2 days.
es: Ejemplo: Si la usaste ayer y hoy, tu racha actual es de 2 días.

# streakInfoBestDesc
source: Your personal record - the longest streak you've ever achieved. It's always equal or greater than your current streak.
es: Tu récord personal: la racha más larga que hayas logrado jamás. Siempre es igual o mayor que tu racha actual.

# streakInfoBestExample
source: Example: If your current streak is 2 days, your best streak is at least 2 days (or higher if you had a longer streak before).
es: Ejemplo: Si tu racha actual son 2 días, tu mejor racha es de al menos 2 días (o mayor si tuviste una racha más larga antes).

# streakInfoTotalDesc
source: The total number of love scans you've performed since you started using the app.
es: El número total de escaneos de amor que has realizado desde que empezaste a usar la app.

# streakInfoTotalExample
source: Example: Every time you scan your crush compatibility, this number goes up.
es: Ejemplo: Cada vez que escaneas la compatibilidad con tu crush, este número aumenta.

# streakInfoTip
source: 💡 Tip: Keep using the app daily to build your streak and discover your love compatibility!
es: 💡 Consejo: ¡Sigue usando la app a diario para construir tu racha y descubrir tu compatibilidad amorosa!

source: Got it!
es: ¡Entendido!

# premiumRequiredTitle
source: Premium Required
es: Premium Requerido

# premiumRequiredContent
source: This feature is available only for Premium users. Upgrade now and unlock all exclusive features!
es: Esta función está disponible solo para usuarios Premium. ¡Actualiza ahora y desbloquea todas las funciones exclusivas!

# premiumUniverseCard
source: Unlock the premium universe: daily personalized horoscopes, love advice, advanced compatibility analysis, no ads.
es: Desbloquea el universo premium: horóscopos personalizados diarios, consejos amorosos, análisis de compatibilidad avanzado, sin anuncios.

# appTitle
source: Crush Scanner 💘
es: Escáner de Crush

# welcomeTitle
source: Discover Your Secret Admirer
es: Descubre a tu Admirador Secreto

# welcomeSubtitle
source: Find out who has a crush on you with our advanced algorithm 💕
es: Descubre quién está enamorado de ti con nuestro algoritmo avanzado 💕

source: Start Scan
es: Comenzar Escaneo

source: Celebrity Scan
es: Escaneo de Celebridades

source: Daily Love
es: Amor Diario

source: Settings
es: Configuración

source: History
es: Historial

source: Your name
es: Tu nombre

source: Enter your name
es: Ingresa tu nombre

# crushName
source: Crush's Name
es: Nombre de tu Crush

# enterCrushName
source: Enter your crush's name
es: Ingresa el nombre de tu crush

source: Scan Now
es: Escanear Ahora

source: Scanning...
es: Escaneando...

# analyzing
source: Analyzing compatibility...
es: Analizando compatibilidad...

# calculatingLove
source: Calculating love percentage...
es: Calculando porcentaje de amor...

source: Scan Complete!
es: ¡Escaneo Completo!

source: Love Percentage
es: Porcentaje de Amor

source: Compatibility Level
es: Nivel de Compatibilidad

source: Share Result
es: Compartir Resultado

source: Scan Again
es: Escanear de Nuevo

source: Back
es: Atrás

source: Dark Mode
es: Modo Oscuro

source: Sound Effects
es: Efectos de Sonido

source: Background Music
es: Música de Fondo

source: Language
es: Idioma

source: Volume
es: Volumen

source: About
es: Acerca de

source: Version
es: Versión

source: Spanish
es: Español

source: English
es: Inglés

# noHistory
source: No scans yet
es: No hay escaneos aún

# startFirstScan
source: Start your first scan to see results here
es: Inicia tu primer escaneo para ver resultados aquí

source: Scan History
es: Historial de Escaneos

source: Delete History
es: Eliminar Historial

source: Confirm Delete
es: Confirmar Eliminación

# deleteHistoryMessage
source: Are you sure you want to delete all scan history? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar todo el historial de escaneos? Esta acción no se puede deshacer.

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

# historyDeleted
source: History deleted successfully
es: Historial eliminado exitosamente

source: Today's Love
es: Amor de Hoy

source: Your Daily Love Reading
es: Tu Lectura Diaria del Amor

source: Love Advice
es: Consejo de Amor

source: Lucky Number
es: Número de la Suerte

source: Love Compatibility
es: Compatibilidad Amorosa

source: Perfect Match! 💖
es: ¡Pareja Perfecta! 💖

source: Excellent Match! 💕
es: ¡Excelente Pareja! 💕

source: Good Match! 💓
es: ¡Buena Pareja! 💓

source: Fair Match 💙
es: Pareja Regular 💙

source: Low Match 💔
es: Baja Compatibilidad 💔

source: Celebrity Scanner
es: Escáner de Celebridades

source: Which celebrity likes you?
es: ¿Qué celebridad gusta de ti?

source: Select Gender
es: Seleccionar Género

source: Male
es: Masculino

# appTitleFull
source: Crush Scanner 💘
es: Escáner de Crush 💘

source: Upgrade
es: Mejorar

source: Premium Only
es: Solo Premium

# remainingScans
source: You have {count} scans left today! 💕
es: ¡Te quedan {count} escaneos hoy! 💕

# noScansLeft
source: No scans left! Watch ads for more
es: ¡Sin escaneos! Ve anuncios para más

# useWisely
source: Use them wisely or get more below 😉
es: Úsalos sabiamente o consigue más abajo 😉

# moreTomorrow
source: Tomorrow you'll have 5 fresh scans waiting, or you can get more now:
es: Mañana tendrás 5 escaneos frescos esperándote, o puedes conseguir más ahora:

source: Watch short ad
es: Ver anuncio corto

# extraScansFree
source: +2 free scans
es: +2 escaneos gratis

source: Unlimited Scans
es: Escaneos Ilimitados

# premiumPriceText
source: Premium for $2.99/month
es: Premium por $2.99/mes

source: Wait until tomorrow
es: Esperar hasta mañana

# freshScans
source: 5 fresh scans free
es: 5 escaneos frescos gratis

# perfectScan
source: Perfect, let's scan! 💘
es: ¡Perfecto, a escanear! 💘

# limitReachedTitle
source: Limit reached!
es: ¡Límite alcanzado!

# limitReachedBody
source: You have used all your free scans for today.
es: Has usado todos tus escaneos gratuitos de hoy.

# limitReachedWhatToDo
source: What can you do?
es: ¿Qué puedes hacer?

source: Watch ad
es: Ver anuncio

# winExtraScans
source: Win +2 extra scans
es: Gana +2 escaneos más

# extraScansWon
source: +2 extra scans won!
es: ¡+2 escaneos ganados!

source: Go Premium
es: Hazte Premium

source: Wait
es: Esperar

source: More scans tomorrow
es: Más escaneos mañana

source: Close
es: Cerrar

source: Female
es: Femenino

source: Any
es: Cualquiera

source: Find Celebrity Match
es: Encontrar Pareja Famosa

source: Your Celebrity Match
es: Tu Pareja Famosa

source: Compatibility Score
es: Puntuación de Compatibilidad

source: Why this match?
es: ¿Por qué esta pareja?

source: Upgrade to Premium
es: Actualizar a Premium

# unlockAllFeatures
source: Unlock all features and enjoy the full experience!
es: ¡Desbloquea todas las funciones y disfruta la experiencia completa!

source: Premium Features
es: Funciones Premium

source: Detailed Analysis
es: Análisis Detallado

source: No Ads
es: Sin Anuncios

source: Exclusive Content
es: Contenido Exclusivo

source: Advanced Compatibility
es: Compatibilidad Avanzada

source: Monthly Plan
es: Plan Mensual

source: Yearly Plan
es: Plan Anual

source: Most Popular
es: Más Popular

# save
source: Save {percentage}%
es: Ahorra {percentage}%

source: Subscribe
es: Suscribirse

source: Restore Purchases
es: Restaurar Compras

# pleaseEnterName
source: Please enter your name
es: Por favor ingresa tu nombre

# pleaseEnterCrushName
source: Please enter your crush's name
es: Por favor ingresa el nombre de tu crush

# shareMessage
source: I got {percentage}% compatibility with {crushName} on Crush Scanner! 💕 Try it yourself: [App Link]
es: ¡Obtuve {percentage}% de compatibilidad con {crushName} en Escáner de Crush! 💕 Pruébalo tú también: [Enlace de la App]

# madeWithLove
source: Made with 💕 to discover love
es: Hecho con 💕 para descubrir el amor

# regularScanSubtitle
source: Discover your compatibility with someone special
es: Descubre tu compatibilidad con alguien especial

# celebrityScanSubtitle
source: Your compatibility with the stars
es: Tu compatibilidad con las estrellas

# formInstructions
source: Enter your name and that of that special person to discover what the heart says about your connection
es: Ingresa tu nombre y el de esa persona especial para descubrir qué dice el corazón sobre su conexión.

# scanLoveButton
source: Scan Love ❤️
es: Escanear Amor ❤️

source: ✨ Personal Algorithm ✨
es: ✨ Algoritmo Personal ✨

# algorithmDescription
source: Our love algorithm analyzes compatibility between real people, based on energies, names and heart connections to reveal romantic secrets.
es: Nuestro algoritmo del amor analiza la compatibilidad entre personas reales, basándose en energías, nombres y conexiones del corazón para revelar secretos románticos.

# soundEffectsSubtitle
source: Sounds on buttons and actions
es: Sonidos en botones y acciones

# backgroundMusicSubtitle
source: Relaxing ambient music
es: Música ambiente relajante

# upgradeSettings
source: Upgrade to Premium
es: Actualizar a Premium

# unlockAllFeaturesSettings
source: Unlock all features
es: Desbloquea todas las funciones

# newBadge
source: NEW
es: NUEVO

# preparingLoveDay
source: Preparing your love day...
es: Preparando tu día del amor...

source: Unknown error
es: Error desconocido

source: Go Back
es: Volver

source: Your Love Universe
es: Tu Universo del Amor

source: Consecutive days
es: Días seguidos

source: Total Scans
es: Escaneos Totales

source: Average
es: Promedio

source: Personalized Tip
es: Consejo Personalizado

source: 🏆 Unlocked Achievements
es: 🏆 Logros Desbloqueados

# shareError
source: Error sharing. Please try again.
es: Error al compartir. Inténtalo de nuevo.

source: Result
es: Resultado

source: Perfect Compatibility!
es: ¡Compatibilidad Perfecta!

source: Great Compatibility!
es: ¡Gran Compatibilidad!

source: Good Compatibility
es: Buena Compatibilidad

source: Share
es: Compartir

# celebrityCrushDescription
source: Discover your compatibility with the brightest stars of Hollywood and the entertainment world
es: Descubre tu compatibilidad con las estrellas más brillantes de Hollywood y el mundo del entretenimiento

# chooseMyCommit
source: Choose My Celebrity Crush ✨
es: Elegir Mi Celebrity Crush ✨

# celebrityModeDescription
source: Our stellar algorithm analyzes your name and the cosmic energy of celebrities to reveal unique connections from the entertainment world.
es: Nuestro algoritmo estelar analiza tu nombre y la energía cósmica de las celebridades para revelarte conexiones únicas del mundo del entretenimiento.

source: 🎬 Popular Celebrities
es: 🎬 Celebridades Populares

source: And many more...
es: Y muchos más...

source: No history yet
es: Aún no hay historial

# noHistoryDescription
source: Your compatibility scans will appear here
es: Tus escaneos de compatibilidad aparecerán aquí

source: Start Scanning
es: Comenzar a Escanear

# errorLoadingHistory
source: Error loading history: {error}
es: Error al cargar el historial: {error}

# agoTime
source: ago
es: hace

source: days
es: días

source: Clear History
es: Limpiar Historial

# confirmClearHistory
source: Are you sure you want to clear your history?
es: ¿Estás seguro de que quieres limpiar tu historial?

# confirmClear
source: Clear
es: Limpiar

# historyCleared
source: History cleared successfully
es: Historial limpiado exitosamente

source: Error clearing history
es: Error al limpiar historial

source: Error sharing result
es: Error al compartir resultado

# premiumSubtitle
source: Unlock the full potential of love!
es: ¡Desbloquea todo el potencial del amor!

# noAdsTitle
source: No Ads
es: Sin Anuncios

# noAdsDescription
source: Enjoy the complete experience without interruptions
es: Disfruta de la experiencia completa sin interrupciones

# unlimitedScansTitle
source: Unlimited Scans
es: Escaneos Ilimitados

# unlimitedScansDescription
source: Scan as much as you want without restrictions
es: Escanea cuantas veces quieras sin restricciones

# exclusiveResultsTitle
source: Exclusive Results
es: Resultados Exclusivos

# exclusiveResultsDescription
source: Access special messages and predictions
es: Accede a mensajes y predicciones especiales

# crushHistoryTitle
source: Crush History
es: Historial de Crushes

# crushHistoryDescription
source: Save and review all your previous scans
es: Guarda y revisa todos tus escaneos anteriores

# specialThemesTitle
source: Special Themes
es: Temas Especiales

# specialThemesDescription
source: Customize the app with unique and exclusive themes
es: Personaliza la app con temas únicos y exclusivos

# premiumSupportTitle
source: Premium Support
es: Soporte Premium

# premiumSupportDescription
source: Priority attention and advanced technical support
es: Atención prioritaria y soporte técnico avanzado

# purchasePremium
source: Get Premium - $2.99/month
es: Obtener Premium - $4.99/mes

source: Welcome to Premium!
es: ¡Bienvenido a Premium!

# premiumActivated
source: Your Premium account has been successfully activated. Enjoy all the exclusive features!
es: Tu cuenta Premium ha sido activada exitosamente. ¡Disfruta de todas las características exclusivas!

source: Great!
es: ¡Genial!

# restorePurchasesButton
source: Restore Purchases
es: Restaurar Compras

source: Processing...
es: Procesando...

# noPreviousPurchases
source: No previous purchases found
es: No se encontraron compras anteriores

source: 💘 Magnetic Connection
es: 💘 Conexión Magnética

# magneticConnectionMessage
source: Today love energies are especially strong. It's the perfect time to discover new connections.
es: Hoy las energías del amor están especialmente fuertes. Es el momento perfecto para descubrir nuevas conexiones.

# magneticConnectionAdvice
source: Keep your heart open to love's surprises.
es: Mantén tu corazón abierto a las sorpresas del amor.

source: ✨ Day of Revelations
es: ✨ Día de Revelaciones

# dayOfRevelationsMessage
source: Heart secrets are ready to be revealed. Someone special might confess something important to you.
es: Los secretos del corazón están listos para ser revelados. Alguien especial podría confesarte algo importante.

# dayOfRevelationsAdvice
source: Pay attention to subtle signs from those around you.
es: Presta atención a las señales sutiles de quien te rodea.

source: 🌹 Romance in the Air
es: 🌹 Romance en el Aire

# romanceInTheAirMessage
source: The universe conspires to create romantic moments. Your crush might be thinking about you more than you imagine.
es: El universo conspira para crear momentos románticos. Tu crush podría estar pensando en ti más de lo que imaginas.

# romanceInTheAirAdvice
source: Be brave and take the first step.
es: Sé valiente y da el primer paso.

source: 💫 Destiny Aligned
es: 💫 Destino Alineado

# destinyAlignedMessage
source: The stars align to favor casual encounters that can change your love life.
es: Las estrellas se alinean para favorecer encuentros casuales que pueden cambiar tu vida amorosa.

# destinyAlignedAdvice
source: Step out of your comfort zone and socialize more.
es: Sal de tu zona de confort y socializa más.

# butterfliesInStomach
source: 🦋 Butterflies in Your Stomach
es: 🦋 Mariposas en el Estómago
