Repository: Carfer0410/Scanner_crush
Catalog: lib/l10n/app_*.arb
Languages: es

# butterfliesInStomachMessage
source: Today you'll feel those special butterflies. Your love intuition is at its highest point.
es: Hoy sentirás esas mariposas especiales. Tu intuición amorosa está en su punto más alto.

# butterfliesInStomachAdvice
source: Trust your heart's instincts.
es: Confía en tus instintos del corazón.

source: 🔥 Burning Passion
es: 🔥 Pasión Ardiente

# burningPassionMessage
source: Romantic energy is at its maximum. It's a perfect day to express your feelings.
es: La energía romántica está al máximo. Es un día perfecto para expresar tus sentimientos.

# burningPassionAdvice
source: Don't repress your emotions, let them flow.
es: No reprimas tus emociones, déjalas fluir.

source: 💎 Authentic Love
es: 💎 Amor Auténtico

# authenticLoveMessage
source: Today you can recognize true love. Superficial connections fade away.
es: Hoy puedes reconocer el amor verdadero. Las conexiones superficiales se desvanecen.

# authenticLoveAdvice
source: Seek depth in your relationships.
es: Busca la profundidad en tus relaciones.

# personalizedTipStreak
source: 🔥 Incredible {streak}-day streak! Your love energy is at its peak.
es: 🔥 ¡Increíble racha de {streak} días! Tu energía amorosa está en su punto máximo.

# personalizedTipCompatibility
source: ⭐ Your average compatibility is excellent ({compatibility}%). You have a good eye for love!
es: ⭐ Tu compatibilidad promedio es excelente ({compatibility}%). ¡Tienes buen ojo para el amor!

# personalizedTipScans
source: 💡 With {scans} scans completed, your love experience is growing. Keep exploring!
es: 💡 Con {scans} escaneos realizados, tu experiencia amorosa está creciendo. ¡Sigue explorando!

# personalizedTipGoodCompatibility
source: 💫 Your average compatibility is good. Trust your love instincts.
es: 💫 Tu compatibilidad promedio es buena. Confía en tus instintos amorosos.

# personalizedTipEncouragement
source: 🌱 Each scan brings you closer to finding your perfect connection. Don't give up!
es: 🌱 Cada escaneo te acerca más a encontrar tu conexión perfecta. ¡No te rindas!

source: 🔥 Fire Streak
es: 🔥 Racha de Fuego

# fireStreakDescription
source: {days} consecutive days
es: {days} días consecutivos

source: 🎯 Love Explorer
es: 🎯 Explorador del Amor

# loveExplorerDescription
source: {scans} scans completed
es: {scans} escaneos realizados

source: ⭐ Compatibility Master
es: ⭐ Maestro de la Compatibilidad

# compatibilityMasterDescription
source: {average}% average
es: {average}% promedio

source: 👑 Romance Guru
es: 👑 Gurú del Romance

# romanceGuruDescription
source: Love expert
es: Experto en el amor

# personalScannerTitle
source: Personal Scanner
es: Escáner Personal

# personalCompatibilityTitle
source: 💕 Your Personal Compatibility 💕
es: 💕 Tu Compatibilidad Personal 💕

# resultTitle
source: Result
es: Resultado

source: There Is Potential
es: Hay Potencial

# shareButton
source: Share
es: Compartir

# scanAgainButton
source: Scan Again
es: Escanear Otra Vez

# celebrityMessage1
source: OMG! Your compatibility with a celebrity is incredible 🌟
es: ¡OMG! Tu compatibilidad con una celebridad es increíble 🌟

# celebrityMessage2
source: Hollywood stars approve this combination ⭐
es: Las estrellas de Hollywood aprueban esta combinación ⭐

# celebrityMessage3
source: Your celebrity crush could be your soulmate! 💫
es: ¡Tu crush famoso podría ser tu media naranja! 💫

# celebrityMessage4
source: Hollywood is talking about this compatibility 🎬
es: Hollywood está hablando de esta compatibilidad 🎬

# celebrityMessage5
source: Plot twist! You have chemistry with a superstar 🎭
es: ¡Plot twist! Tienes química con una superestrella 🎭

# celebrityMessage6
source: Your celebrity compatibility level is off the charts! 📈
es: ¡Tu nivel de compatibilidad con celebridades está por las nubes! 📈

# celebrityMessage7
source: Breaking news! You're compatible with a star 📺
es: ¡Noticia de último momento! Eres compatible con una estrella 📺

# celebrityMessage8
source: Love's red carpet is waiting for you 🌹
es: La alfombra roja del amor te está esperando 🌹

# celebrityMessage9
source: Paparazzi alert! You have a special connection 📸
es: ¡Alerta paparazzi! Tienes una conexión especial 📸

# celebrityMessage10
source: Your love story could be a blockbuster movie 🍿
es: Tu historia de amor podría ser una película taquillera 🍿

# celebrityMessage11
source: Award-winning compatibility detected! 🏆
es: ¡Compatibilidad ganadora de premios detectada! 🏆

# celebrityMessage12
source: Gossip magazines would be talking about you two 📰
es: Las revistas de chismes estarían hablando de ustedes dos 📰

# celebrityMessage13
source: Your celebrity crush approves this combination 💕
es: Tu crush famoso aprueba esta combinación 💕

# celebrityMessage14
source: Lights, camera, love! You have celebrity couple potential 🎥
es: ¡Luces, cámara, amor! Tienes potencial de pareja de famosos 🎥

# celebrityMessage15
source: The celebrity universe conspires in your favor ✨
es: El universo de las celebridades conspira a tu favor ✨

# romanticMessage1
source: Your hearts beat in perfect rhythm! 💕
es: ¡Sus corazones laten al ritmo perfecto! 💕

# romanticMessage2
source: The stars align perfectly for you both ✨
es: Las estrellas se alinean perfectamente para ambos ✨

# romanticMessage3
source: There's a special connection waiting to be discovered 🌙
es: Hay una conexión especial esperando ser descubierta 🌙

# romanticMessage4
source: Destiny has woven its threads between you two 💫
es: El destino ha tejido sus hilos entre ustedes dos 💫

# romanticMessage5
source: Your souls seem to speak love's same language 💝
es: Sus almas parecen hablar el mismo idioma del amor 💝

# romanticMessage6
source: Love's magic is floating in the air 🎭
es: La magia del amor está flotando en el aire 🎭

# romanticMessage7
source: There's undeniable chemistry between you 🔥
es: Hay una química innegable entre ustedes 🔥

# romanticMessage8
source: The universe conspires in favor of your love 🌟
es: El universo conspira a favor de su amor 🌟

# romanticMessage9
source: Your energies complement each other perfectly 🌸
es: Sus energías se complementan a la perfección 🌸

# romanticMessage10
source: There's more than friendship waiting to bloom 🌺
es: Hay algo más que amistad esperando florecer 🌺

# romanticMessage11
source: The compatibility between you is amazing 💖
es: La compatibilidad entre ustedes es asombrosa 💖

# romanticMessage12
source: True love might be closer than you think 💘
es: El amor verdadero podría estar más cerca de lo que piensas 💘

# romanticMessage13
source: Your hearts vibrate on the same frequency 🎵
es: Sus corazones vibran en la misma frecuencia 🎵

# romanticMessage14
source: The attraction between you is magnetic ⚡
es: La atracción entre ustedes es magnética ⚡

# romanticMessage15
source: Cupid already has his arrows aimed at you 🏹
es: Cupido ya tiene sus flechas dirigidas hacia ustedes 🏹

# romanticMessage16
source: Your paths are destined to cross again and again 🛤️
es: Sus caminos están destinados a cruzarse una y otra vez 🛤️

# romanticMessage17
source: Love's flame burns intensely between you 🕯️
es: La llama del amor arde intensamente entre ustedes 🕯️

# romanticMessage18
source: There's a cosmic connection that binds you 🌌
es: Hay una conexión cósmica que los une 🌌

# romanticMessage19
source: Love is writing its own story 📖
es: El amor está escribiendo su propia historia 📖

# romanticMessage20
source: Your hearts speak a language only you understand 💬
es: Sus corazones hablan un idioma que solo ustedes entienden 💬

# mysteriousMessage1
source: Heart's secrets are about to be revealed... 🔮
es: Los secretos del corazón están a punto de revelarse... 🔮

# mysteriousMessage2
source: Someone thinks of you more than you imagine 👁️
es: Alguien piensa en ti más de lo que imaginas 👁️

# mysteriousMessage3
source: Universe's signals are trying to tell you something 🌠
es: Las señales del universo tratan de decirte algo 🌠

# mysteriousMessage4
source: Hidden feelings will soon come to light 🌅
es: Los sentimientos ocultos pronto saldrán a la luz 🌅

# mysteriousMessage5
source: Love's mystery is about to unfold 🎭
es: El misterio del amor está a punto de desplegarse 🎭

# mysteriousMessage6
source: Invisible forces are working in your favor 👻
es: Las fuerzas invisibles están trabajando a tu favor 👻

# mysteriousMessage7
source: Heart's whispers are reaching you 🍃
es: Los susurros del corazón están llegando a ti 🍃

# mysteriousMessage8
source: There's a love story waiting to be told 📚
es: Hay una historia de amor esperando ser contada 📚

# mysteriousMessage9
source: Destiny's threads are intertwining 🕸️
es: Los hilos del destino se están entrelazando 🕸️

# mysteriousMessage10
source: Something magical is about to happen in love 🎪
es: Algo mágico está a punto de suceder en el amor 🎪

# mysteriousMessage11
source: Love's tarot cards are shuffling 🃏
es: Las cartas del tarot del amor se están barajando 🃏

# mysteriousMessage12
source: A romantic secret is floating in the air 💨
es: Un secreto romántico está flotando en el aire 💨

# mysteriousMessage13
source: The full moon brings heart revelations 🌕
es: La luna llena trae revelaciones del corazón 🌕

# mysteriousMessage14
source: There are glances that say more than a thousand words 👀
es: Hay miradas que dicen más que mil palabras 👀

# mysteriousMessage15
source: A loving heart's echo resonates nearby 🔊
es: El eco de un corazón enamorado resuena cerca 🔊

# mysteriousMessage16
source: Something beautiful is brewing in silence 🤫
es: Algo hermoso se está gestando en silencio 🤫

# mysteriousMessage17
source: Stars whisper love secrets 🌟
es: Las estrellas susurran secretos de amor 🌟

# mysteriousMessage18
source: A heart message is waiting to be sent 💌
es: Un mensaje del corazón está esperando ser enviado 💌

# mysteriousMessage19
source: Love's magic is creating invisible connections ✨
es: La magia del amor está creando conexiones invisibles ✨

# mysteriousMessage20
source: There's a romantic surprise on the horizon 🎁
es: Hay una sorpresa romántica en el horizonte 🎁

# funMessage1
source: Houston, we have a connection! 🚀
es: ¡Houston, tenemos una conexión! 🚀

# funMessage2
source: Your crush-o-meter is through the roof 📈
es: Tu crush-ómetro está por las nubes 📈

# funMessage3
source: Heart alert! Danger of falling in love 🚨
es: ¡Alerta corazón! Peligro de enamorarse 🚨

# funMessage4
source: The love detector is ringing loudly 📢
es: El detector de amor está sonando fuerte 📢

# funMessage5
source: Bingo! You've found a perfect match 🎯
es: ¡Bingo! Has encontrado una combinación perfecta 🎯

# funMessage6
source: Your compatibility level is off the charts! 📊
es: ¡Tu nivel de compatibilidad está fuera de serie! 📊

# funMessage7
source: Ding ding ding! We have a love winner 🛎️
es: ¡Ding ding ding! Tenemos un ganador del amor 🛎️

# funMessage8
source: Love's GPS is guiding you to something special 🗺️
es: El GPS del amor te guía hacia algo especial 🗺️

# funMessage9
source: Emotional jackpot! You've hit the bullseye 🎰
es: ¡Jackpot emocional! Has dado en el blanco 🎰

# funMessage10
source: Your heart just made a perfect match 💕
es: Tu corazón acaba de hacer match perfecto 💕

# funMessage11
source: Eureka! Love's formula has been deciphered 🧪
es: ¡Eureka! La fórmula del amor ha sido descifrada 🧪

# funMessage12
source: The romance thermometer is about to explode 🌡️
es: El termómetro del romance está a punto de explotar 🌡️

# funMessage13
source: Breaking news! Chemistry detected between you 📺
es: ¡Noticia de último momento! Química detectada entre ustedes 📺

# funMessage14
source: Your love radar is picking up strong signals 📡
es: Tu radar del amor está captando señales fuertes 📡

# funMessage15
source: Plot twist! Your crush might be thinking of you 🎬
es: ¡Plot twist! Tu crush podría estar pensando en ti 🎬

# funMessage16
source: Love's algorithm says you're compatible 💻
es: El algoritmo del amor dice que son compatibles 💻

# funMessage17
source: Spoiler alert! There's romance in your future 📱
es: ¡Spoiler alert! Hay romance en tu futuro 📱

# funMessage18
source: Your love app just sent a notification 📲
es: Tu app del amor acaba de enviarte una notificación 📲

# funMessage19
source: Achievement unlocked! You've found your match 🏆
es: ¡Logro desbloqueado! Has encontrado tu match 🏆

# funMessage20
source: Heart's bluetooth has connected successfully 📶
es: El bluetooth del corazón se ha conectado con éxito 📶

# lowCompatibilityMessage1
source: Sometimes differences create the perfect spark ⚡
es: A veces las diferencias crean la chispa perfecta ⚡

# lowCompatibilityMessage2
source: True love overcomes any percentage 💪
es: El amor verdadero supera cualquier porcentaje 💪

# lowCompatibilityMessage3
source: Opposites attract and create magic 🧲
es: Los opuestos se atraen y crean magia 🧲

# lowCompatibilityMessage4
source: Not all great loves start with 100% 📈
es: No todos los grandes amores empiezan con 100% 📈

# lowCompatibilityMessage5
source: Give time to time, love grows step by step 🌱
es: Dale tiempo al tiempo, el amor crece paso a paso 🌱

# lowCompatibilityMessage6
source: Compatibility is built day by day 🏗️
es: La compatibilidad se construye día a día 🏗️

# lowCompatibilityMessage7
source: Maybe you need to get to know each other better 🤔
es: Tal vez necesitan conocerse mejor 🤔

# lowCompatibilityMessage8
source: Real love doesn't always follow statistics 📊
es: El amor real no siempre sigue las estadísticas 📊

# lowCompatibilityMessage9
source: There's room for something beautiful to grow 🌻
es: Hay espacio para que algo hermoso crezca 🌻

# lowCompatibilityMessage10
source: The best romances start as friendship 👫
es: Los mejores romances empiezan como amistad 👫

source: Light Theme
es: Tema Claro

source: Dark Theme
es: Tema Oscuro

source: You are Premium!
es: ¡Eres Premium!

# enjoyAllFeatures
source: Enjoy all features without limits
es: Disfruta de todas las funciones sin límites

# purchaseError
source: Purchase error: {error}
es: Error en la compra: {error}

# getFullAccess
source: Get full access to all special features
es: Obtén acceso completo a todas las funciones especiales

source: Special Offer
es: Oferta Especial

source: Cancel anytime
es: Cancela cuando quieras

source: Support
es: Soporte

# helpAndQuestions
source: Help & Questions
es: Ayuda y Preguntas

# getHelpOnApp
source: Get help on how to use the app
es: Obtén ayuda sobre cómo usar la app

# helpDialogTitle
source: 💕 Help
es: 💕 Ayuda

# helpDialogContent
source: Crush Scanner is a fun app that calculates compatibility between two people based on their names.\n\n• Enter your name and your crush's name\n• Press \"Scan Love\"\n• Discover your compatibility\n• Share the result\n\nIt's just for fun! 😄
es: Escáner de Crush es una app divertida que calcula la compatibilidad entre dos personas basándose en sus nombres.\n\n• Ingresa tu nombre y el de tu crush\n• Presiona \"Escanear Amor\"\n• Descubre tu compatibilidad\n• Comparte el resultado\n\n¡Es solo por diversión! 😄

# understood
source: Got it
es: Entendido

# aboutDialogTitle
source: 💘 About
es: 💘 Acerca de

# aboutDialogContent
source: Crush Scanner v1.0.0\n\nA fun application to discover love compatibility.\n\nDeveloped with Flutter and lots of love 💕\n\n© 2025 Crush Scanner
es: Escáner de Crush v1.0.0\n\nUna aplicación divertida para descubrir la compatibilidad amorosa.\n\nDesarrollada con Flutter y mucho amor 💕\n\n© 2024 Escáner de Crush

# streakTitle
source: Daily Streak
es: Racha Diaria

source: Current Streak
es: Racha Actual

source: Best Streak
es: Mejor Racha

# daysStreak
source: {count, plural, =0{0 days} =1{1 day} other{{count} days}}
es: {count, plural, =0{0 días} =1{1 día} other{{count} días}}

# streakMaintain
source: Don't break your streak!
es: ¡No rompas tu racha!

# streakAtRisk
source: Streak at risk! Scan now to maintain it 🔥
es: ¡Racha en riesgo! Escanea ahora para mantenerla 🔥

# firstScanStreak
source: 🎉 Welcome! Your love journey begins now!
es: 🎉 ¡Bienvenido! ¡Tu aventura de amor comienza ahora!

# streakBroken
source: 💔 Streak broken, but you're back! New streak started
es: 💔 Racha rota, ¡pero regresaste! Nueva racha iniciada

# newStreakRecord
source: 🏆 NEW RECORD! {days} days streak! You're unstoppable!
es: 🏆 ¡NUEVO RÉCORD! ¡{days} días de racha! ¡Eres imparable!

# streakContinues
source: 🔥 Streak continues! {days} days of love scanning!
es: 🔥 ¡La racha continúa! ¡{days} días escaneando amor!

source: ✨ Premium Required
es: ✨ Premium Requerido

# premiumRequiredMessage
source: This theme is available only for Premium users. Unlock all themes and more features!
es: Este tema está disponible solo para usuarios Premium. ¡Desbloquea todos los temas y más funciones!

source: View Premium
es: Ver Premium

# unlockDeepInsights
source: Unlock deep insights about your love life with advanced analytics, predictions and compatibility patterns.
es: Desbloquea insights profundos sobre tu vida amorosa con analytics avanzados, predicciones y patrones de compatibilidad.

# upgradeToPremiumAnalytics
source: Upgrade to Premium
es: Upgrade a Premium

# analyzingLoveLife
source: Analyzing your love life...
es: Analizando tu vida amorosa...

source: Error loading analytics
es: Error cargando analytics

# unknownErrorAnalytics
source: Unknown error
es: Error desconocido

source: Retry
es: Reintentar

# statisticsTab
source: Statistics
es: Estadísticas

# predictionsTab
source: Predictions
es: Predicciones

# totalScansAnalytics
source: Total Scans
es: Total Escaneos

# averageAnalytics
source: Average
es: Promedio

source: Best Match
es: Mejor Match

# celebritiesAnalytics
source: Celebrities
es: Celebridades

# compatibilityTrend
source: 📈 Compatibility Trend (30 days)
es: 📈 Tendencia de Compatibilidad (30 días)

# notEnoughDataTrends
source: Not enough data to show trends
es: No hay suficientes datos para mostrar tendencias

source: Last 30 days
es: Últimos 30 días

source: 🏆 Your Best Matches
es: 🏆 Tus Mejores Matches

# changeAppTheme
source: Change the app theme
es: Cambiar el tema de la aplicación

source: Advanced Analytics
es: Analytics Avanzados

# analyticsDescription
source: Compatibility charts and statistics
es: Gráficos y estadísticas de compatibilidad

source: Cloud Backup
es: Backup en la Nube

# cloudBackupDescription
source: Your data safe and synchronized
es: Tus datos seguros y sincronizados

# perMonth
source: /month
es: /mes

# unlockFullPotential
source: Unlock the full potential of love!
es: ¡Desbloquea todo el potencial del amor!

source: Purchases restored successfully
es: Compras restauradas exitosamente

# defaultPrice
source: $2.99/month
es: $4.99/mes

# themesTitle
source: 🎨 Premium Themes
es: 🎨 Temas Premium

# customizeExperience
source: Customize your experience
es: Personaliza tu experiencia

source: Current Theme
es: Tema Actual

source: ACTIVE
es: ACTIVO

# themeApplied
source: Theme {themeName} applied
es: Tema {themeName} aplicado

# classicThemeName
source: 💘 Classic
es: 💘 Clásico

# classicThemeDescription
source: The original love theme
es: El tema original de amor

# sunsetThemeName
source: 🌅 Sunset
es: 🌅 Aurora Pastel

# sunsetThemeDescription
source: Warm golden and orange tones
es: Tonos pastel con purpura

# oceanThemeName
source: 🌊 Ocean
es: 🌊 Océano

# oceanThemeDescription
source: Deep marine blues
es: Profundos azules marinos

# forestThemeName
source: 🌲 Forest
es: 🌲 Bosque

# forestThemeDescription
source: Natural and fresh greens
es: Verdes naturales y frescos

# lavenderThemeName
source: 💜 Lavender
es: 💜 Lavanda

# lavenderThemeDescription
source: Elegant purples and violets
es: Elegantes púrpuras y violetas

# cosmicThemeName
source: 🌌 Cosmic
es: 🌌 Cósmico

# cosmicThemeDescription
source: Mysterious deep space
es: Misterioso espacio profundo

# cherryThemeName
source: 🌸 Cherry
es: 🌸 Cerezo

# cherryThemeDescription
source: Elegant Japanese sakura pink
es: Elegante rosa sakura japonés

# goldenThemeName
source: ✨ Golden
es: ✨ Dorado

# goldenThemeDescription
source: Luxury and golden elegance
es: Lujo y elegancia dorada

# scansToday
source: Today's scans: {remaining}/{total}
es: Escaneos de hoy: {remaining}/{total}

# scansRemaining
source: {count} free scans remaining
es: Quedan {count} escaneos gratis

# premiumBenefits
source: 🚀 Unlimited scans • 🚫 No ads • ⭐ Exclusive content
es: 🚀 Escaneos ilimitados • 🚫 Sin anuncios • ⭐ Contenido exclusivo

source: 🎉 Trial Period!
es: 🎉 ¡Período de Prueba!

# unlimitedScansRemaining
source: UNLIMITED scans for {days} more days
es: Escaneos ILIMITADOS por {days} días más

# scansRemainingToday
source: {count} scans remaining today
es: {count} escaneos restantes hoy

source: Limit reached!
es: ¡Límite alcanzado!

# watchAdForMore
source: Watch ad for +2 more
es: Ver anuncio para +2 más

source: Upgrade for unlimited
es: Upgradea para ilimitados

# watchAdOrUpgrade
source: Watch ad or upgrade for more
es: Ve anuncio o upgradea para más

source: Premium Analytics
es: Analytics Premium

# analyzeCompatibilityPatterns
source: Analyze your compatibility patterns
es: Analiza tus patrones de compatibilidad

source: Premium Themes
es: Temas Premium

# customizeWithThemes
source: Customize with 8 unique themes
es: Personaliza con 8 temas únicos
